{
    "Fitbit Versa 4": [
        "Great for fitness tracking, but lacks third-party app support. The health monitoring features are comprehensive.",
        "The AMOLED display is vibrant and easy to read in sunlight. The touch response is smooth.",
        "Battery life is decent but could be better for its price. The charging is quick when needed.",
        "Comfortable and lightweight for all-day wear. The strap is adjustable and breathable.",
        "Limited smartwatch features compared to competitors. Perfect for fitness-focused users."
    ],
    "Garmin Instinct 2X": [
        "Solar charging is a game-changer for outdoor enthusiasts. The battery life is exceptional.",
        "Rugged build makes it durable for extreme conditions. The buttons are responsive.",
        "Battery life is exceptional, lasting indefinitely with solar exposure. Perfect for long adventures.",
        "GPS accuracy is top-notch for hiking and running. The tracking features are comprehensive.",
        "Lacks AMOLED display, but MIP screen is easy to read in sunlight. Great for outdoor activities."
    ],
    "Amazfit T-Rex 2": [
        "Military-grade durability ensures long-lasting performance. The build quality is impressive.",
        "Excellent battery life, perfect for long trips. The power management is efficient.",
        "GPS tracking is highly accurate and fast. The outdoor features are comprehensive.",
        "Display is bright and clear, even outdoors. The touch response is reliable.",
        "Lacks third-party app support compared to premium brands. Great value for money."
    ],
    "Suunto 9 Peak Pro": [
        "Premium design and lightweight build feel high-end. The materials are quality.",
        "Exceptional battery life for long adventures. The power management is excellent.",
        "GPS precision is one of the best in class. The tracking features are detailed.",
        "Display is small but sharp and easy to read. The interface is intuitive.",
        "High price tag compared to similar models. Perfect for serious athletes."
    ],
    "Huawei Watch Ultimate": [
        "Elegant design with a premium build quality. The materials are high-end.",
        "Battery life is solid for a high-end smartwatch. The charging is quick.",
        "AMOLED display is stunning and vibrant. The touch response is smooth.",
        "Water resistance up to 100m is a huge plus. Perfect for water sports.",
        "Lacks Google services, which may limit some functionality. Great for Huawei ecosystem users."
    ],
    "Coros Vertix 2": [
        "Insane battery life, lasting weeks on a single charge. The power efficiency is impressive.",
        "GPS tracking is ultra-accurate, even in remote areas. The outdoor features are comprehensive.",
        "Rugged and built for extreme conditions. The build quality is exceptional.",
        "Lacks a touchscreen, making navigation slightly tedious. The buttons are responsive.",
        "Price is steep, but worth it for serious athletes. Perfect for extreme sports."
    ],
    "Apple Watch Ultra 2": [
        "Best-in-class display with ultra-bright Retina screen. The visibility is excellent.",
        "Strong build with titanium casing. The materials are premium.",
        "Limited battery life compared to adventure watches. The charging is quick.",
        "Perfect integration with iPhone and Apple ecosystem. The features are comprehensive.",
        "Expensive but offers top-tier features. Great for Apple ecosystem users."
    ],
    "Garmin Venu 2 Plus": [
        "AMOLED display is beautiful and vibrant. The touch response is smooth.",
        "Fitness tracking is detailed and accurate. The health features are comprehensive.",
        "Battery life is good but not the best for Garmin. The charging is efficient.",
        "Great smart features, including voice assistant support. The connectivity is reliable.",
        "Expensive compared to alternatives with similar features. Perfect for fitness enthusiasts."
    ],
    "Fossil Gen 6": [
        "Stylish design that blends smartwatch and classic aesthetics. The look is premium.",
        "Performance is fast with Wear OS but limited battery life. The interface is smooth.",
        "AMOLED screen is bright and sharp. The touch response is responsive.",
        "Lacks advanced fitness tracking features. Great for style-conscious users.",
        "Battery life struggles with heavy usage. The charging is quick when needed."
    ],
    "Amazfit Bip 3 Pro": [
        "Excellent battery life for a budget smartwatch. The power efficiency is impressive.",
        "Lightweight and comfortable for daily wear. The strap is breathable.",
        "GPS accuracy is decent but not top-tier. The tracking features are basic.",
        "Lacks premium build materials. The design is functional.",
        "Great value for money. Perfect for budget-conscious buyers."
    ],
    "Garmin Approach S62": [
        "Best golf watch with course maps and detailed tracking. The golf features are comprehensive.",
        "Battery life is solid for a feature-packed device. The power management is efficient.",
        "Display is easy to read even under sunlight. The interface is golf-focused.",
        "Price is high but justified for golfers. The build quality is premium.",
        "Lacks some smartwatch features found in non-golf models. Perfect for golf enthusiasts."
    ],
    "Samsung Galaxy Watch Active 2": [
        "Compact and lightweight, perfect for active users. The design is modern.",
        "AMOLED display is crisp and responsive. The touch response is smooth.",
        "Battery life is good but not exceptional. The charging is quick.",
        "Excellent integration with Samsung devices. The features are comprehensive.",
        "Lacks newer health features found in the latest models. Great for Samsung ecosystem users."
    ],
    "Huawei Band 8": [
        "Super affordable fitness tracker with solid features. The value is excellent.",
        "Battery life is excellent for its size. The power efficiency is impressive.",
        "No built-in GPS, which limits fitness tracking. The features are basic.",
        "AMOLED display is sharp and colorful. The touch response is reliable.",
        "Great for basic fitness tracking needs. Perfect for budget-conscious users."
    ],
    "Realme Watch 3 Pro": [
        "AMOLED display is large and vibrant. The visibility is excellent.",
        "GPS support is great for a budget smartwatch. The tracking features are decent.",
        "Battery life is decent but could be better. The charging is quick.",
        "Build quality feels plasticky. The design is modern.",
        "Great value for money with decent features. Perfect for budget buyers."
    ],
    "Boat Wave Elite": [
        "Affordable and stylish design. The look is modern.",
        "LCD display is decent but lacks premium feel. The visibility is good.",
        "Battery life is average, needing frequent charging. The power management is basic.",
        "No GPS, limiting outdoor tracking accuracy. The features are basic.",
        "Good for basic smartwatch functionalities. Great for budget-conscious users."
    ],
    "Noise ColorFit Pro 4": [
        "Large display makes it easy to read notifications. The visibility is good.",
        "Decent battery life for daily use. The power efficiency is satisfactory.",
        "No built-in GPS, which is a downside for fitness users. The features are basic.",
        "Affordable price point for basic smartwatch features. The value is good.",
        "Build quality could be better. Perfect for casual users."
    ],
    "Dizo Watch R": [
        "AMOLED display is a nice touch at this price point. The visibility is excellent.",
        "Battery life is solid, lasting over a week. The power efficiency is impressive.",
        "No GPS, making outdoor tracking less effective. The features are basic.",
        "Water resistance is decent for everyday wear. The build quality is good.",
        "Great value for budget-conscious buyers. Perfect for casual users."
    ],
    "Apple Watch Series 9": [
        "The Series 9 is a solid upgrade, with a faster processor and better integration with iPhone. Battery life could be better, though.",
        "Love the health tracking features! ECG and SpO2 monitoring are very accurate. A bit pricey, but worth it.",
        "Smooth performance and bright display. The new double-tap gesture is useful.",
        "Wish it had longer battery life, but the fast charging helps.",
        "Siri is much more responsive, and the integration with Apple ecosystem is seamless."
    ],
    "Samsung Galaxy Watch 6": [
        "Great design and vibrant display. Battery life lasts nearly two days, which is an improvement.",
        "Runs Wear OS smoothly, but some apps are still missing.",
        "Samsung Health is very detailed, and sleep tracking is one of the best in class.",
        "The watch feels premium and the rotating bezel is intuitive.",
        "Good fitness tracking, but I wish there were more strap options."
    ],
    "Garmin Fenix 7": [
        "Unbeatable battery life! Lasts for weeks on a single charge.",
        "GPS accuracy is top-notch for outdoor activities.",
        "Bit bulky on smaller wrists, but the build quality is fantastic.",
        "A great companion for serious athletes and hikers.",
        "The screen isn't as vibrant as AMOLED, but visibility in sunlight is perfect."
    ],
    "Fitbit Sense 2": [
        "Fantastic for stress tracking, but Fitbit premium is expensive.",
        "Battery life is excellent, lasts almost a week!",
        "Lack of third-party apps is disappointing.",
        "Comfortable to wear 24/7, even while sleeping.",
        "ECG and SpO2 monitoring are great additions."
    ],
    "Google Pixel Watch 2": [
        "Stylish and compact, perfect for everyday use.",
        "Smooth Wear OS experience but needs better battery life.",
        "Google Assistant is very responsive.",
        "Love the Fitbit integration for health tracking.",
        "Charging is fast, but I still need to do it daily."
    ],
    "Amazfit GTR 4": [
        "Great value for money, amazing battery life.",
        "Sleep tracking is pretty accurate.",
        "Design is sleek and lightweight.",
        "The companion app is user-friendly.",
        "Wish it had more third-party app support."
    ],
    "Garmin Forerunner 965": [
        "A runner's dream watch! Excellent GPS and heart rate tracking.",
        "Expensive but worth it for serious athletes.",
        "Battery life is phenomenal.",
        "Very durable and comfortable for long runs.",
        "Garmin Connect app provides deep insights."
    ],
    "OnePlus Watch 2": [
        "Impressive battery life for a Wear OS watch.",
        "Looks premium, but the software needs some improvements.",
        "Good fitness tracking, but lacks app variety.",
        "Smooth UI and solid build quality.",
        "A solid mid-range smartwatch option."
    ],
    "Samsung Galaxy Watch 5 Pro": [
        "Rugged design and fantastic battery life.",
        "Samsung Pay works flawlessly.",
        "Comfortable to wear despite its size.",
        "Sleep tracking is highly detailed.",
        "Tizen apps are a bit limited."
    ],
    "TicWatch Pro 5": [
        "Dual display is a game changer for battery life.",
        "Big and bulky, but packed with features.",
        "Wear OS feels smoother than before.",
        "Speaker quality is great for calls.",
        "Fast charging is a lifesaver."
    ],
    "Garmin Epix Pro": [
        "Superb AMOLED display, finally on a Garmin!",
        "Battery lasts forever, even with GPS on.",
        "Very expensive but built like a tank.",
        "Great for outdoor adventures.",
        "Garmin Pay is useful, but app selection is limited."
    ]
} 