{
    "Apple AirPods Pro 2": [
        "The active noise cancellation is incredible! Perfect for blocking out background noise during calls and music.",
        "Love the spatial audio feature—it creates an immersive listening experience. The transparency mode is also very natural.",
        "Battery life is decent, and the MagSafe charging case is convenient. The fit is comfortable for long listening sessions.",
        "The H2 chip makes everything super responsive. The adaptive EQ works well for different types of music.",
        "Pricey but worth it for the premium features and seamless Apple ecosystem integration."
    ],
    "Sony WF-1000XM5": [
        "Best-in-class noise cancellation! The sound quality is exceptional with deep bass and clear highs.",
        "Battery life is impressive, and the quick charging is a lifesaver. The companion app is feature-rich.",
        "The call quality is excellent with clear voice pickup. The touch controls are intuitive.",
        "Comfortable for extended wear, and the fit is secure. The ambient sound mode is very natural.",
        "Premium price but delivers premium performance. Perfect for audiophiles who want wireless freedom."
    ],
    "Bose QuietComfort Earbuds II": [
        "Industry-leading comfort! Can wear them for hours without any discomfort. The noise cancellation is top-notch.",
        "Sound quality is balanced and natural. The Aware mode is perfect for staying aware of surroundings.",
        "Battery life is good, and the case is compact. The fit is customizable with different ear tips.",
        "Call quality is crystal clear. The touch controls are responsive and easy to use.",
        "Expensive but worth it for the comfort and noise cancellation quality."
    ],
    "Samsung Galaxy Buds2 Pro": [
        "Excellent sound quality with rich bass and clear vocals. The noise cancellation works well.",
        "Love the seamless integration with Samsung devices. The battery life is impressive.",
        "The 360 audio feature is immersive. The touch controls are responsive and intuitive.",
        "Comfortable fit for long listening sessions. The voice detection feature is useful.",
        "Great value for the features offered. Perfect for Samsung ecosystem users."
    ],
    "Google Pixel Buds Pro": [
        "Clean, balanced sound with good bass. The noise cancellation is effective.",
        "Google Assistant integration is seamless. The battery life is decent.",
        "The spatial audio feature is impressive. The touch controls are easy to use.",
        "Comfortable for extended wear. The multipoint connection is convenient.",
        "Good value for money. The case is compact and easy to carry."
    ],
    "Jabra Elite 7 Pro": [
        "Outstanding call quality with multi-sensor voice pickup. The noise cancellation is strong.",
        "Battery life is excellent, and the case is durable. The sound quality is well-balanced.",
        "The HearThrough feature is natural. The fit is secure and comfortable.",
        "Great for both music and calls. The companion app is feature-rich.",
        "Premium features at a reasonable price. Perfect for business users."
    ],
    "Beats Fit Pro": [
        "Secure fit with wing tips! Perfect for workouts. The sound quality is energetic.",
        "Apple ecosystem integration is seamless. The battery life is good.",
        "Active noise cancellation works well. The spatial audio feature is immersive.",
        "Comfortable for long listening sessions. The touch controls are responsive.",
        "Great for fitness enthusiasts. The case is compact and portable."
    ],
    "Sennheiser Momentum True Wireless 3": [
        "Exceptional sound quality with rich detail. The noise cancellation is effective.",
        "Battery life is impressive. The companion app offers great customization.",
        "Build quality is premium. The touch controls are intuitive.",
        "Comfortable for extended wear. The sound is well-balanced.",
        "Expensive but delivers audiophile-grade sound quality."
    ],
    "Anker Soundcore Liberty 4": [
        "Great value for money! The sound quality is impressive for the price.",
        "Battery life is excellent. The noise cancellation is decent.",
        "Comfortable fit with multiple ear tip options. The touch controls work well.",
        "Good for both music and calls. The case is compact.",
        "Perfect budget option with premium features."
    ],
    "Nothing Ear (2)": [
        "Unique transparent design! The sound quality is clean and detailed.",
        "Active noise cancellation is effective. The battery life is good.",
        "Comfortable for long listening sessions. The touch controls are responsive.",
        "Great value for the features. The case is stylish.",
        "Perfect for those who want something different. The companion app is user-friendly."
    ],
    "Sony LinkBuds S": [
        "Lightweight and comfortable! The sound quality is excellent.",
        "Battery life is decent. The noise cancellation works well.",
        "Perfect for everyday use. The touch controls are intuitive.",
        "Good value for money. The case is compact.",
        "Great all-rounder with no major compromises."
    ],
    "Bose Sport Earbuds": [
        "Perfect for workouts! The fit is secure and comfortable.",
        "Sound quality is energetic. The battery life is good.",
        "Water and sweat resistant. The touch controls are responsive.",
        "Great for active lifestyles. The case is durable.",
        "Excellent for sports and exercise. The companion app is useful."
    ],
    "JBL Live Pro 2": [
        "Strong bass and clear vocals. The noise cancellation is effective.",
        "Battery life is impressive. The case is compact.",
        "Comfortable for extended wear. The touch controls work well.",
        "Good value for money. The companion app is feature-rich.",
        "Perfect for bass lovers. The build quality is solid."
    ],
    "Shure SE846": [
        "Audiophile-grade sound quality! The isolation is excellent.",
        "Premium build quality. The sound is incredibly detailed.",
        "Comfortable with proper fit. The cable is durable.",
        "Perfect for professional use. The sound signature is balanced.",
        "Expensive but delivers exceptional sound quality."
    ],
    "Sony WH-1000XM5": [
        "Best-in-class noise cancellation! The sound quality is exceptional.",
        "Battery life is impressive. The build quality is premium.",
        "Comfortable for long listening sessions. The touch controls are intuitive.",
        "Great for both music and calls. The companion app is feature-rich.",
        "Expensive but worth it for the premium features."
    ],
    "Apple AirPods Pro (2nd Gen)": [
        "The noise cancellation is fantastic, and the transparency mode feels very natural. A great upgrade!",
        "Battery life is decent, but I wish it lasted a bit longer without the case. Still, the sound quality is amazing.",
        "Comfortable fit, easy pairing with Apple devices, and solid bass. Worth the premium price.",
        "The case is compact and charges quickly. Spatial audio makes movies and music so immersive.",
        "Would have liked a different design, but the improvements in ANC and sound clarity are worth it."
    ],
    "Sony WF-1000XM5": [
        "The best noise cancellation in any earbuds I've tried! Sound is rich, and the fit is comfortable.",
        "Battery life is great for long commutes. Sony's app has a lot of customization options.",
        "Call quality has improved a lot over the previous version. Crystal-clear sound in busy areas.",
        "The bass is punchy but not overpowering. Perfect for audiophiles who love balanced sound.",
        "Slightly expensive, but the performance justifies the cost. I highly recommend it!"
    ],
    "Bose QuietComfort Earbuds II": [
        "Top-tier ANC! These block out noise better than any other earbuds. Bose nailed it again.",
        "Comfortable for long use, but the case is bulkier than expected. Still, the sound is unbeatable.",
        "Perfect for frequent travelers. The clarity in calls and music is exceptional.",
        "Battery life could be better, but the fast charging helps. Bose quality shines through.",
        "Expensive, but worth every penny if noise cancellation is your priority."
    ],
    "Samsung Galaxy Buds 2 Pro": [
        "Very lightweight and comfortable to wear for long hours. Sound is crisp with deep bass.",
        "Pairs seamlessly with Samsung devices. The 360 Audio feature is amazing!",
        "Water resistance is a plus, and the ANC works well in noisy environments.",
        "Battery life is solid, but I wish the case had a more premium feel.",
        "Great value for the price. These easily rival more expensive earbuds."
    ],
    "Jabra Elite 7 Pro": [
        "These are the best earbuds for calls. The multi-mic setup ensures clear voice quality.",
        "Stays in place even during workouts. Sweat resistance is a great feature.",
        "Battery life is impressive, and the ANC is decent but not the best.",
        "Great app support with a customizable EQ. Sound is clear and balanced.",
        "Solid build quality and comfortable fit. Worth it for professionals who take a lot of calls."
    ],
    "Sennheiser Momentum True Wireless 3": [
        "Premium sound with deep bass and clear mids. Sennheiser never disappoints!",
        "Build quality feels solid, and the design is sleek. The ANC is effective.",
        "Battery life is good but not the best. However, the sound quality makes up for it.",
        "The case is a bit large, but the earbuds fit comfortably and securely.",
        "Great for music lovers. These are some of the best-sounding earbuds I've used."
    ],
    "Google Pixel Buds Pro": [
        "Seamless integration with Google Assistant makes these super convenient to use.",
        "The bass is powerful, and the ANC is better than expected.",
        "Battery life is excellent, and the case provides extra hours without frequent charging.",
        "Call quality is clear, and the touch controls are responsive.",
        "Perfect for Android users. Easily one of the best in this price range."
    ],
    "OnePlus Buds Pro 2": [
        "Great battery life! These last longer than most competitors in the same range.",
        "Sound is clear with a decent amount of bass. Works well with Dolby Atmos.",
        "The ANC is effective but not the best compared to Sony or Bose.",
        "Comfortable to wear for long durations. No ear fatigue.",
        "A solid alternative to premium brands at a lower price point."
    ],
    "Nothing Ear (2)": [
        "The transparent design is unique and stylish. Love the aesthetics!",
        "Sound is well-balanced, and the ANC is quite effective.",
        "Touch controls are smooth and customizable. Pairing is effortless.",
        "Battery life is decent, but it drains faster with ANC on.",
        "Good for the price, especially if you want something stylish and functional."
    ],
    "Beats Fit Pro": [
        "Best earbuds for workouts! Secure fit and sweat resistance make them ideal.",
        "Apple ecosystem integration is flawless. Works just like AirPods.",
        "ANC is solid, and the sound is tuned well for bass-heavy music.",
        "Battery life is okay, but the quick charge feature is helpful.",
        "Slightly expensive, but the performance and fit are worth it."
    ],
    "Sony LinkBuds S": [
        "Super lightweight and comfortable. You forget you're even wearing them!",
        "Sound quality is fantastic, and the ANC does a great job.",
        "Battery life is okay, but not as long as other Sony models.",
        "Great for casual listening and calls. Compact case is a plus.",
        "Would recommend for those who prefer all-day comfort over larger earbuds."
    ],
    "Anker Soundcore Liberty 4": [
        "Budget-friendly and feature-packed. The sound quality is impressive!",
        "ANC is decent, but not as strong as premium models.",
        "The battery lasts long, and the case provides extra charges.",
        "Comfortable and lightweight, but the case feels a bit plasticky.",
        "A great option if you want good quality without spending too much."
    ],
    "Realme Buds Air 3": [
        "Good ANC for the price. It blocks out a lot of background noise.",
        "Battery life is solid, and the case is compact and easy to carry.",
        "Sound is decent with strong bass, but mids could be clearer.",
        "Touch controls are responsive, but sometimes a bit sensitive.",
        "Affordable and functional. A great buy for budget-conscious users."
    ],
    "Redmi Buds 4 Pro": [
        "Surprisingly good sound for the price. Dual drivers enhance clarity.",
        "The ANC works well in moderate noise environments.",
        "Battery life is reliable, and fast charging is a plus.",
        "Feels comfortable for long hours, but the case is slightly bulky.",
        "Great value for money. Beats expectations for an affordable pair of earbuds."
    ],
    "Oppo Enco X2": [
        "The sound quality is exceptional, with rich bass and clear treble. The noise cancellation works well in noisy environments.",
        "Battery life is great, lasting almost 10 hours on a single charge. The case provides additional backup, making it reliable for long trips.",
        "Comfortable to wear for extended periods, but the fit might be slightly loose for intense workouts.",
        "Call quality is excellent, with clear voice transmission even in windy conditions.",
        "A solid option at this price, but the touch controls can be a bit sensitive at times."
    ],
    "JBL Live Pro 2": [
        "JBL's sound signature is amazing, with deep bass and balanced mids. Perfect for music lovers.",
        "Battery life lives up to expectations, easily lasting 10 hours. The fast charging is a bonus.",
        "ANC is effective, though not as strong as premium models like Sony or Bose.",
        "Build quality feels premium, and the earbuds are comfortable even after long hours.",
        "Good for calls, but the mic could perform better in noisy environments."
    ],
    "Skullcandy Indy ANC": [
        "Punchy bass and a fun sound profile, great for bass lovers!",
        "The ANC is decent but not on par with high-end brands. Works well for moderate noise isolation.",
        "Battery life could be better; 5 hours isn't enough for a full day of use.",
        "Stylish design, but they can feel a bit bulky in the ears after extended use.",
        "Easy-to-use touch controls, though they can sometimes misinterpret taps."
    ],
    "SoundPEATS Air3 Pro": [
        "For the price, the sound is great! The clarity and bass response are impressive.",
        "Battery life is average, but the case provides a decent backup.",
        "ANC is just okay, but it does reduce some background noise.",
        "Fits snugly and doesn't fall out easily, making it great for workouts.",
        "Call quality is clear in quiet places but struggles in noisy environments."
    ],
    "Huawei FreeBuds Pro 2": [
        "The dual-driver setup makes a noticeable difference in sound quality. The bass is tight, and the treble is crisp.",
        "Comfortable fit with an elegant design. The case feels premium as well.",
        "The noise cancellation is top-notch, comparable to premium models.",
        "Battery life is decent, but could be better considering the price.",
        "Great for calls, even in noisy surroundings."
    ],
    "Boat Airdopes 441": [
        "Affordable and reliable for casual listening, but don't expect premium sound.",
        "Battery life is decent at 5 hours, and the case gives ample backup.",
        "No active noise cancellation, but the fit provides passive isolation.",
        "Water resistance is a nice touch for workouts and outdoor use.",
        "Touch controls can be tricky and sometimes unresponsive."
    ],
    "Noise Air Buds Pro 2": [
        "Good sound quality for the price, though bass can be a bit overpowering.",
        "Active noise cancellation is a nice feature at this price point.",
        "Comfortable to wear but may feel loose for some ear shapes.",
        "Battery life is reliable, lasting over 6 hours per charge.",
        "Call quality is satisfactory, but background noise reduction needs improvement."
    ],
    "Boult Audio AirBass XPods Pro": [
        "Very affordable, and the sound is surprisingly decent for the price.",
        "Battery life is impressive, lasting over 6 hours easily.",
        "Passive noise cancellation helps in reducing some background sound.",
        "The design is stylish, but the build quality feels a bit plasticky.",
        "Connectivity is strong, and pairing is seamless."
    ],
    "Wings Phantom 850": [
        "Great battery life! Lasts almost 8 hours on a single charge.",
        "The design is modern and gaming-inspired, making it look cool.",
        "Sound quality is decent, but the bass could be stronger.",
        "Call clarity is acceptable, though wind noise can be an issue.",
        "Passive noise isolation is decent but doesn't block all external noise."
    ],
    "Ptron Bassbuds Jade": [
        "Budget-friendly option with decent sound quality.",
        "Battery life is good for the price, and the case offers extra backup.",
        "No ANC, but passive isolation is effective to some extent.",
        "Fits well, but prolonged use might cause slight discomfort.",
        "Build quality could be improved, but it's acceptable at this price point."
    ],
    "Mivi DuoPods A350": [
        "Superb battery life! Lasts over 8 hours per charge.",
        "Bass-heavy sound, great for those who love deep beats.",
        "Passive noise isolation works fine in moderate noise settings.",
        "Build quality is sturdy and feels durable.",
        "The mic is decent, but calls in noisy areas can be challenging."
    ],
    "Fire-Boltt FirePods Polaris": [
        "Affordable and offers good battery life for regular use.",
        "The sound is fairly balanced, with decent mids and highs.",
        "Passive noise cancellation helps a bit but doesn't eliminate all noise.",
        "Build quality is okay, but the charging case feels a bit flimsy.",
        "Mic quality is fine for calls, but background noise can be an issue."
    ],
    "Hammer Airflow Pro": [
        "Nice design and lightweight build make them comfortable.",
        "Sound quality is decent, but lacks some depth.",
        "Battery life is good, lasting over 6 hours per charge.",
        "Call quality is satisfactory, but could be improved in noisy areas.",
        "Touch controls are responsive and easy to use."
    ],
    "Dizo Buds Z Pro": [
        "The design is compact and stylish, making them easy to carry.",
        "Sound is clear, but could use a bit more bass.",
        "Battery life is sufficient for daily use.",
        "Passive noise cancellation works in moderately noisy areas.",
        "Connectivity is fast and stable."
    ],
    "Wings Phantom 550": [
        "Great for gaming, with a stylish design and good latency control.",
        "Battery life is impressive at 9 hours of continuous use.",
        "The bass is strong, but mids and highs could be better.",
        "Call quality is decent, but noise handling needs improvement.",
        "A solid budget option for gamers and music lovers alike."
    ]
} 